"""
集合: set
集合是无序、无重复元素、可变的数据容器，用 {} 定义，自动去重，支持数学集合运算（交集、并集、差集），无索引概念。
无序：从集合中取出元素的顺序和定义集合时存入的顺序不一定一致
# 定义
集合名 = {元素1, 元素2, 元素3}，用花括号{}包裹
# 空集合必须用 set()，不能用{}，空集合直接用{}定义，是字典。
非空集合可以用{}定义，s1 = {1,3,5,7,9}
"""
#1.包含重复元素的列表
names = ['小明','小红','小赵','小李','小红']
print(names)#['小明', '小红', '小赵', '小李', '小红']
#将list转为集合，set()自动去重
name_set = set(names)#set() 将列表转为集合
print(name_set)#{'小赵', '小红', '小李', '小明'}

#2.向集合中添加元素
s = {1,2,3}
s.add(4)
#添加重复元素，无效果
s.add(2)
print(s)#{1, 2, 3, 4}
#定义空集合
#不能直接写{}来定义空集合，因为直接写{}定义的是：空字典。
s1 = set()
print(type(s1))#<class 'set'>

#3.并集
class1 = {'张三', '李四'}
class2 = {'李四', '王五'}
#并集运算：合并所有元素，去重
all_student = class2 | class1
print(all_student)#{'王五', '李四', '张三'}, 无序集合
print(class1 & class2)#交集操作，{'李四'}


#使用 in 判断元素是否存在
print('张三' in class1)
#remove(key)方法删除元素
s.remove(4)
print(s)#{1, 2, 3}

#4.定义有内容的不可变集合，使用frozenset函数
s1 = frozenset({10,20,30,40,50,60,70})
print(type(s1),s1)#<class 'frozenset'> frozenset({50, 20, 70, 40, 10, 60, 30})
# frozenset 接收的参数，可以是任意可迭代对象，但最终返回的一定是【不可变集合】
s1 = frozenset([10, 20, 30, 40, 50])
s2 = frozenset((10, 20, 30, 40, 50))
s3 = frozenset('hello')#字符串也是可迭代对象
print(type(s1), s1)
print(type(s2), s2)
print(type(s3), s3)

# 集合中不能嵌套【可变集合】，但可以嵌套【不可变集合】
# 通俗理解：只有“不可变”的东西，才能安全的放进集合里
s1 = {10, 20, 30, 40, 50}
s2 = frozenset({100, 200, 300, 400, 500})
l1 = [666, 777, 888]
t1 = ('hello', 'atguigu', '北京')

#s3 = {11, 22, 33, s1}  # 报错
s3 = {11, 22, 33, s2}  # 没问题
print(s3)#{frozenset({400, 100, 500, 200, 300}), 33, 11, 22}
#s3 = {11, 22, 33, l1}  # 报错
s3 = {11, 22, 33, t1}  # 没问题，因为t1是元组，内容不可变
print(s3)#{33, 11, ('hello', 'atguigu', '北京'), 22}，集合是无序的，输出和定义时顺序不一样

#集合的一些常用方法
#update方法：向集合中添加元素（必须传递可迭代对象，例如：列表、元组、集合等）
s1 = {10,20,30,40,50}
s1.update([60,70])
s1.update((80,90,100))#接收可迭代对象
s1.update({100,20})
s1.update(range(300,303))
print(s1)#{70, 10, 80, 20, 90, 30, 100, 40, 300, 301, 302, 50, 60},输出内容无序

#remove方法：从集合中移除元素（移除不存在的元素，会报错）
s1 = {10, 20, 30, 40, 50}
s1.remove(20)
print(s1)#{50, 40, 10, 30}

# discard方法：从集合中移除元素（移除不存在的元素，不会报错）
s1 = {10, 20, 30, 40, 50}
s1.discard(80)
print(s1)

# pop方法：从集合中移除最后那个元素元素，返回值是移除的那个元素
s1 = {10, 20, 30, 40, 50}
s2 = {'你好', '北京', '尚硅谷', 'hello'}
result = s1.pop()
print(s1)
print(result)
r2 = s2.pop()
print(s2)#{'尚硅谷', '北京', '你好'}
print(r2)#hello
#r3 = s2.pop('北京'),pop()不接受参数
#print(r3)
#print(s2)

# clear方法：清空集合
s1 = {10, 20, 30, 40, 50}
s1.clear()
print(s1)

# 改
# 使用 add + remove 的组合，来实现修改的效果
s1 = {10, 20, 30, 40, 50}
s1.remove(20)
s1.add(66)
print(s1)#{50, 66, 40, 10, 30}, 输出无序

#查询
#集合/所有数据容器都可以使用"成员运算符"判断某个元素是否在集合/数据容器中
s1 = {10,20,30,40,50,60}
#s1[0],出错，因为集合是无序的，不能通过下标访问元素
re1 = 20 not in s1
print(re1)#False

#集合的常用方法
#1.A.difference(B), 找出集合A中不同于集合B的元素
#作用：返回一个新的集合，原集合A和B不变
s1 = {10, 20, 30, 40, 50}
s2 = {30, 40, 50, 60, 70}
result = s1.difference(s2)
print(s1)
print(s2)
print(result)#{10, 20}

#2.集合A.difference_update(集合B)
# 作用：从集合A中，删除集合B中存在的元素（集合A会被修改，集合B不会）
s1 = {10, 20, 30, 40, 50}
s2 = {30, 40, 50, 60, 70}
s1.difference_update(s2)
print(s1)
print(s2)

# 集合A.union(集合B)：
# 作用：合并两个集合，集合A 和 集合B 都不变，返回的是一个新的集合
s1 = {10, 20, 30, 40, 50}
s2 = {30, 40, 50, 60, 70}
result = s2.union(s1)
print(s1)

# 集合A.issubset(集合B)：
# 作用：判断集合A是否为集合B的子集
# 如果 集合A的所有元素都在集合B中，那就返回True，否则返回False
s1 = {10, 20, 30, 40, 50}
s2 = {30, 40, 50, 60, 70}
s3 = {30, 40, 50}
result = s3.issubset(s1)
print(result)

# 集合A.issuperset(集合B)：
# 作用：判断集合A是否是集合B的超集
# 如果集合A中，包含了集合B中的所有元素，那就返回True，否则返回False
s1 = {10, 20, 30, 40, 50}
s2 = {30, 40, 50, 60, 70}
s3 = {30, 40, 50}
result = s1.issuperset(s3)
print(result)

# 集合A.isdisjoint(集合B)：
# 作用：判断A和B是否没有交集
# 如果没有交集，返回True；只要有一个公共元素，就返回False
s1 = {10, 20, 30, 40, 50}
s2 = {30, 40, 50, 60, 70}
s3 = {80, 90}
result = s1.isdisjoint(s2)
print(result)

#集合的数学运算
s1 = {10, 20, 30, 40, 50, 60}
s2 = {40, 50, 60, 70, 80, 90}
# 并集
result = s1 | s2
print(result)
# 交集
result = s1 & s2
print(result)
# 差集
result = s1 - s2
print(result)
# 对称差集
result = s1 ^ s2
print(result)
"""
{70, 40, 10, 80, 50, 20, 90, 60, 30}
{40, 50, 60}
{10, 20, 30}
{70, 10, 80, 20, 90, 30}
"""

#集合的循环遍历
#由于集合不支持下标，所以不能用while循环，但可以使用for
for item in s1:
    print(item)

"""
集合的特点总结：
1.	无序：集合中的元素没有固定顺序，无法通过下标访问。
2.	不重复：集合会自动去重，同一个元素只会保留一份。
3.	分为两种：可变集合合（set）和不可变集合（forzenset）。
4.	集合中的元素必须是不可变类型（如：数字、字符串、元组）。
5.	集合支持：并集、交集、差集、对称差集等数学操作。
📍一句话总结：集合是可以去重的数据容器，当只关心元素是否存在，而不在乎顺序的时，首选集合。
"""





