"""
序列：能连续存放元素的数据容器，而且元素有先后顺序，而且可以通过下标访问，所以我们学过的：列表、元组、字符串，都是序列。
切片：从序列中按照指定范围，取出一部分元素，形成一个新的序列的操作
语法格式：序列[起始索引:结束索引:步长]
1.切片操作的区间是左闭右开的，即：截取时包含起始位置，但不包含结束位置。
2.步长：取出元素的间隔。步长为n时，每次越过n-1个元素取出。步长为1时，就是一个一个取元素。
3.起始索引默认值为0，结束索引默认截取到末尾，步长默认值为1。
4.当起始索引大于结束索引时，步长必须为负数，否则结果是空列表。
"""
#对列表进行切片
list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
list2 = list1[0:5:1]#起始索引，结束索引，步长,左闭右开
print(list2)#[10, 20, 30, 40, 50]

list2 = list1[1:8:2]#步长为2，隔1个元素取一个元素
print(list2)#[20, 40, 60, 80]

list2 = list1[1:8:3]
print(list2)#[20, 50, 80]

list2 = list1[::]#起始索引默认为0，结束索引默认为结尾值，步长默认为1
print(list2)#[10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

list2 = list1[3::]#起始为3，
print(list2)

list2 = list1[:5:]
print(list2)#[10, 20, 30, 40, 50],左闭右开

list2 = list1[::4]#步长为4
print(list2)#[10, 50, 90]

#当起始索引大于结束索引时，步长必须为负数，否则结果是空列表
list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
list2 = list1[7:2:-1]#从80输出到40，倒着输出
print(list2)  # [80, 70, 60, 50, 40]

#一个特殊情况：当同时省略起始索引和结束索引时，如果步长为负数，那Python会自动对调：起始位置和结束位置
list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
list2 = list1[::-1]
print(list2)  # [100, 90, 80, 70, 60, 50, 40, 30, 20, 10]

#对元组进行切片
tuple1 = (10, 20, 30, 40, 50, 60, 70, 80, 90, 100)
tuple2 = tuple1[0:5:1]
print(tuple2)  # (10, 20, 30, 40, 50)

#对字符串进行切片
tuple1 = (10, 20, 30, 40, 50, 60, 70, 80, 90, 100)
tuple2 = tuple1[0:5:1]
print(tuple2)  # (10, 20, 30, 40, 50)

# 对字符串进行切片
msg1 = 'welcome to atguigu'
msg2 = msg1[2:9:2]
print(msg2)#loet

#把两个序列拼接在一起，只有同类型的序列才能相加
ls1 = [10,20,30,40]
ls2 = [50,60,70,80]
ls3 = ls1 + ls2
print(ls3)#[10, 20, 30, 40, 50, 60, 70, 80]

#元组和列表的相加一样
#字符串相加
str1 = 'hello'
str2 = ' CQUPT'
str3 = str1+str2
print(str3)#hello CQUPT

#序列相乘(重复)：把序列按照指定的次数重复
ls2 = ls1*3
print(ls2)#[10, 20, 30, 40, 10, 20, 30, 40, 10, 20, 30, 40]
#元组重复和列表一样

str1 = 'hello'
print(str1*6)











